{
  "versions": [
    {
      "version": "0.3.0",
      "date": "06.04.2025",
      "changes": [
        "Erweiterung der CI-Workflow: Integration eines Tokens f\\u00fcr den Push-Zugriff auf private Repos, Verbesserung der Python-Abh\\u00e4ngigkeitsverwaltung durch Nutzung der requirements.txt, und Optimierung der Release-Notizen-Erstellung.",
        "Einf\\u00fchrung neuer Funktionen zur Analyse und Auslesung der aktuellen Version im Software-Release-Prozess, inklusive verbesserter Fehlerbehandlung.",
        "Verbesserung der Verarbeitung und Darstellung von Release-Notizen durch Trim-Logik und JSON-Formatierung, um die Genauigkeit und Konsistenz der Notizen zu erh\\u00f6hen.",
        "Optimierung des CI-Workflows durch Anpassung der Installationsbefehle und Verbesserungen im Umgang mit Abh\\u00e4ngigkeiten.",
        "Aktualisierung der API zur Rechnungsbeleg-Analyse mit Unterst\\u00fctzung f\\u00fcr neue Felder, erweiterte Validierungen und verbesserte PDF-Generierung f\\u00fcr finanzielle Details."
      ],
      "build": "20250406_134328",
      "commit": "4b45d3c311f60a0cb05c6b54a93a232209e73e9d"
    },
    {
      "version": "0.2.0",
      "date": "06.04.2025",
      "changes": [
        "Aktualisierung des CI-Workflows, um den Push-Zugriff auf private Repos durch Hinzufügen eines Tokens zu verbessern, die Installation von Abhängigkeiten aus der requirements.txt zu ermöglichen und die Python-Umgebungseinrichtung zu optimieren.",
        "Einführung einer Methode zur Auslesung der aktuellen Version aus der Datei version.txt, Verbesserung der Analyse-Logik der Commits und der Fehlerbehandlung beim Parsen der OpenAI-Antwort.",
        "Verbesserung der Verarbeitung und Generierung der Release-Notizen durch Hinzufügen einer Trim-Logik und Optimierung der Logik zur Handhabung von Versionsinformationen.",
        "Erweiterung des CI-Workflows zur Erstellung von Release-Notizen in JSON-Format, Verbesserung der Release-Notizen-Komponente für eine verbesserte Benutzeroberfläche.",
        "Vereinfachung des CI-Workflows durch Entfernen von Coverage-Tests und Anpassung der Testausführung, Aktualisierung der Badge für die Testabdeckung und Anpassung der Codecov-Aktion.",
        "Aktualisierung der API zur Rechnungsbeleg-Analyse mit Unterstützung für neue Felder, Verbesserung der Validierungen und der PDF-Generierung für finanzielle Details.",
        "Hinzufügen von Unterstützung für ausländische Rechnungen, Erweiterung der API um neue Felder für MwSt. und Netto-Beträge sowie Anpassung der Validierungs- und Beschreibung der Eingabefelder."
      ],
      "build": "20250406_134051",
      "commit": "4b45d3c311f60a0cb05c6b54a93a232209e73e9d"
    },
    {
      "version": "0.1.9",
      "date": "06.04.2025",
      "changes": [],
      "build": "14290817185",
      "commit": "558875e0df28f53721226037d2c79db1b14ff973"
    },
    {
      "version": "0.1.8",
      "date": "06.04.2025",
      "changes": [],
      "build": "14290798264",
      "commit": "d5d49bdbc81855344b3f8cccd515ffc70ccd86f7"
    },
    {
      "version": "0.1.7",
      "date": "06.04.2025",
      "changes": [],
      "build": "14290771469",
      "commit": "18da220bd166e35603c61db45bb998f744c71904"
    },
    {
      "version": "0.1.6",
      "date": "06.04.2025",
      "changes": [],
      "build": "14290680510",
      "commit": "9c4d14a5e75924fa19d7a866693a58103bdc7102"
    },
    {
      "version": "0.1.5",
      "date": "06.04.2025",
      "changes": [],
      "build": "14290661576",
      "commit": "c503b739afbdd52a42e809dd1cdccc5db2a8014f"
    },
    {
      "version": "0.1.4",
      "date": "06.04.2025",
      "changes": [],
      "build": "14290628051",
      "commit": "aae7cea8cde85aa2d00f3dbf8bfeef83a42533a1"
    },
    {
      "version": "0.1.3",
      "date": "06.04.2025",
      "changes": [],
      "build": "14290613804",
      "commit": "6e8db2c5062acef1c6f096db60776f75335a8a1c"
    }
  ]
}